NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_scanner.c
/* Copyright (c) 2010 - 2017, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include "scanner.h"
#include <unity.h>
#include <cmock.h>
#include "packet_buffer_mock.h"
#include "timer_mock.h"
#include "timer_scheduler_mock.h"
#include "radio_config_mock.h"
#include "timeslot_mock.h"
#include "nrf_mesh_assert.h"
#include "nrf_mesh_cmsis_mock_mock.h"
#include "filter_engine_mock.h"
#include "bearer_event_mock.h"

/* Include module to be tested (to get access to internal state) */
#include "../../bearer/src/scanner.c"

/* Initialize the RADIO peripheral, it will be externed by the headers. */
NRF_RADIO_Type * NRF_RADIO;
static NRF_RADIO_Type m_radio;
NRF_PPI_Type * NRF_PPI;
static NRF_PPI_Type m_ppi;
NRF_TIMER_Type * NRF_TIMER0;
static NRF_TIMER_Type m_timer0;

#define TIME_NOW                (123)
#define RSSISAMPLE_VALUE        (50)
#define RXMATCH_VALUE           (5)
#define DATAWHITEIV_VALUE       (37)
#define TIME_UNTIL_END_EVENT    (100)
#define BEARER_EVENT_FLAG       (7)

nrf_mesh_assertion_handler_t m_assertion_handler;

static int packet_buffer_free_callback_cnt = 0;

void test_init(void);
void test_enable_CONTINUOUS(void);
void test_disable(void);
void test_radio_start_IN_WINDOW(void);
void test_timer_scan_window_start_callback_NO_CHANNEL_INDEX_WRAP(void);
void test_radio_irq_handler_AFTER_WINDOW_START(void);
void test_timer_scan_window_end_callback(void);

/* Assertion handler, automatically fails the test. */
void nrf_mesh_assertion_handler(uint32_t pc)
{
    TEST_FAIL_MESSAGE("Mesh assertion triggered\n");
}

/******** Helper functions ********/
static void scanner_init_helper(void)
{
    test_init();

    m_scanner.packet_buffer.size = SCANNER_BUFFER_SIZE;
    m_scanner.packet_buffer.head = 0;
    m_scanner.packet_buffer.tail = 0;
    m_scanner.packet_buffer.buffer = (uint8_t *) m_scanner.packet_buffer_data;
}

static void scanner_enable_helper(void)
{
    test_enable_CONTINUOUS();
}

static void scanner_disable_helper(void)
{
    test_disable();
}

static void scanner_start_helper(void)
{
    test_radio_start_IN_WINDOW();
    NRF_RADIO->STATE = RADIO_STATE_STATE_RxIdle;
}

static void scanner_window_start_helper(void)
{
    test_timer_scan_window_start_callback_NO_CHANNEL_INDEX_WRAP();
}

static void scanner_window_started_helper(void)
{
    test_radio_irq_handler_AFTER_WINDOW_START();
    NRF_RADIO->STATE = RADIO_STATE_STATE_Rx;
}

static void scanner_window_end_helper(void)
{
    test_timer_scan_window_end_callback();
}

static void scanner_reset(void)
{
    memset(&m_scanner, 0, sizeof(m_scanner));
    m_scanner.window_state = SCAN_WINDOW_STATE_ON;
}

static bool scanner_packet_process_callback(void)
{
    return true;
}

/******** CUnit callbacks ********/
void setUp(void)
{
    packet_buffer_mock_Init();
    timer_mock_Init();
    timer_scheduler_mock_Init();
    radio_config_mock_Init();
    timeslot_mock_Init();
    nrf_mesh_cmsis_mock_mock_Init();
    filter_engine_mock_Init();

    memset(&m_radio,  0, sizeof(NRF_RADIO_Type));
    memset(&m_ppi,    0, sizeof(NRF_PPI_Type));
    memset(&m_timer0, 0, sizeof(NRF_TIMER_Type));

    NRF_RADIO           = (NRF_RADIO_Type*) &m_radio;
    NRF_PPI             = (NRF_PPI_Type*) &m_ppi;
    NRF_TIMER0          = (NRF_TIMER_Type*) &m_timer0;
    m_assertion_handler = nrf_mesh_assertion_handler;

    packet_buffer_free_callback_cnt = 0;
}

void tearDown(void)
{
    packet_buffer_mock_Verify();
    packet_buffer_mock_Destroy();
    timer_mock_Verify();
    timer_mock_Destroy();
    timer_scheduler_mock_Verify();
    timer_scheduler_mock_Destroy();
    radio_config_mock_Verify();
    radio_config_mock_Destroy();
    timeslot_mock_Verify();
    timeslot_mock_Destroy();
    nrf_mesh_cmsis_mock_mock_Verify();
    nrf_mesh_cmsis_mock_mock_Destroy();
    filter_engine_mock_Verify();
    filter_engine_mock_Destroy();
    scanner_reset();
}

/******** Tests ********/
void test_init(void)
{
    packet_buffer_init_Expect(&m_scanner.packet_buffer,
                              m_scanner.packet_buffer_data,
                              SCANNER_BUFFER_SIZE);
    bearer_event_flag_add_ExpectAndReturn(scanner_packet_process_callback, BEARER_EVENT_FLAG);
    scanner_init(scanner_packet_process_callback);
    TEST_ASSERT_EQUAL(SCANNER_STATE_IDLE, m_scanner.state);
    TEST_ASSERT_EQUAL(SCAN_WINDOW_STATE_ON, m_scanner.window_state);
    TEST_ASSERT_EQUAL(BEARER_EVENT_FLAG, m_scanner.nrf_mesh_process_flag);
}

void test_enable_CONTINUOUS(void)
{
    scanner_init_helper();
    timer_now_ExpectAndReturn(TIME_NOW);
    timer_sch_abort_Expect(&m_scanner.timer_window_end);
    timer_sch_reschedule_Expect(&m_scanner.timer_window_start, TIME_NOW);
    scanner_enable();
    TEST_ASSERT_EQUAL(SCANNER_STATE_RUNNING, m_scanner.state);
}

void test_enable_NOT_CONTINUOUS(void)
{
    /* Test behavior on successful enable operation when not in continuous mode */
    scanner_init_helper();
    timer_now_ExpectAndReturn(TIME_NOW);
    timer_sch_reschedule_Expect(&m_scanner.timer_window_end,
                                TIME_NOW + MS_TO_US(BEARER_SCAN_WINDOW_DEFAULT_MS));
    timer_sch_reschedule_Expect(&m_scanner.timer_window_start, TIME_NOW);
    scanner_config_scan_time_set(MS_TO_US(BEARER_SCAN_INT_DEFAULT_MS) * 2,
                                 MS_TO_US(BEARER_SCAN_WINDOW_DEFAULT_MS));
    scanner_enable();
    TEST_ASSERT_EQUAL(SCANNER_STATE_RUNNING, m_scanner.state);

