NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_scanner.c
    /* Test enabling when already enabled */
    scanner_enable();
    TEST_ASSERT_EQUAL(SCANNER_STATE_RUNNING, m_scanner.state);
}

void test_disable(void)
{
    /* Test when enabled, without radio context */
    scanner_enable_helper();
    timer_sch_abort_Expect(&m_scanner.timer_window_end);
    timer_sch_abort_Expect(&m_scanner.timer_window_start);
    scanner_disable();
    TEST_ASSERT_EQUAL(SCANNER_STATE_IDLE, m_scanner.state);

    /* Test after being disabled */
    scanner_disable();
    TEST_ASSERT_EQUAL(SCANNER_STATE_IDLE, m_scanner.state);

    /* Test when enabled, with radio context */
    scanner_reset();
    scanner_enable_helper();
    m_scanner.has_radio_context = true;
    timer_sch_abort_Expect(&m_scanner.timer_window_end);
    timer_sch_abort_Expect(&m_scanner.timer_window_start);
    NVIC_SetPendingIRQ_Expect(RADIO_IRQn);
    scanner_disable();
    TEST_ASSERT_EQUAL(SCANNER_STATE_IDLE, m_scanner.state);
}

void test_is_enabled(void)
{
    /* Check return value when not initialized */
    TEST_ASSERT_EQUAL(false, scanner_is_enabled());

    /* Check return value when not enabled */
    scanner_init_helper();
    TEST_ASSERT_EQUAL(false, scanner_is_enabled());

    /* Check return value when enabled */
    scanner_reset();
    scanner_enable_helper();
    TEST_ASSERT_EQUAL(true, scanner_is_enabled());
}

void test_rx(void)
{
    packet_buffer_packet_t * p_packet_buffer_packet =
        (packet_buffer_packet_t *)m_scanner.packet_buffer_data;

    scanner_init_helper();

    /* Check behavior when packet buffer does not return a packet */
    packet_buffer_pop_ExpectAndReturn(&m_scanner.packet_buffer, NULL, NRF_ERROR_NOT_FOUND);
    packet_buffer_pop_IgnoreArg_pp_packet();
    fen_filters_apply_IgnoreAndReturn(false);
    TEST_ASSERT_NULL(scanner_rx());

    /* Check behavior when packet buffer returns a packet */
    packet_buffer_pop_ExpectAndReturn(&m_scanner.packet_buffer, NULL, NRF_SUCCESS);
    packet_buffer_pop_IgnoreArg_pp_packet();
    packet_buffer_pop_ReturnThruPtr_pp_packet(&p_packet_buffer_packet);
    fen_filters_apply_IgnoreAndReturn(false);
    TEST_ASSERT_EQUAL_PTR(p_packet_buffer_packet->packet, scanner_rx());
}

void test_packet_release(void)
{
    packet_buffer_packet_t packet_buffer_packet;

    scanner_init_helper();

    /* Test when not waiting for memory */
    packet_buffer_free_Expect(&m_scanner.packet_buffer, &packet_buffer_packet);
    scanner_packet_release((const scanner_packet_t *)&packet_buffer_packet.packet);

    /* Test when waiting for memory (and have radio context) */
    m_scanner.waiting_for_memory = true;
    m_scanner.has_radio_context = true;
    packet_buffer_free_Expect(&m_scanner.packet_buffer, &packet_buffer_packet);
    NVIC_SetPendingIRQ_Expect(RADIO_IRQn);
    scanner_packet_release((const scanner_packet_t *)&packet_buffer_packet.packet);
}

void test_config_radio_config_set(void)
{
    scanner_config_radio_mode_set(RADIO_MODE_BLE_1MBIT);
    TEST_ASSERT_EQUAL_UINT8(RADIO_MODE_BLE_1MBIT, m_scanner.config.radio_config.radio_mode);
}

void test_config_scan_time_set(void)
{
    uint32_t scan_interval_us        = MS_TO_US(BEARER_SCAN_INT_DEFAULT_MS);
    uint32_t scan_interval_us_double = MS_TO_US(BEARER_SCAN_INT_DEFAULT_MS) * 2;
    uint32_t scan_window_us          = MS_TO_US(BEARER_SCAN_WINDOW_DEFAULT_MS);

    /* No timers should be scheduled when not enabled */
    scanner_init_helper();
    scanner_config_scan_time_set(scan_interval_us_double, scan_window_us);

    /* When enabled in continuous mode, window start timer shall be scheduled */
    scanner_reset();
    scanner_enable_helper();
    timer_now_ExpectAndReturn(TIME_NOW);
    timer_sch_reschedule_Expect(&m_scanner.timer_window_end,
                                TIME_NOW + MS_TO_US(BEARER_SCAN_WINDOW_DEFAULT_MS));
    timer_sch_reschedule_Expect(&m_scanner.timer_window_start, TIME_NOW);
    scanner_config_scan_time_set(scan_interval_us_double, scan_window_us);

    /* Verify resulting state */
    TEST_ASSERT_EQUAL_UINT32(scan_interval_us_double, m_scanner.config.scan_interval_us);
    TEST_ASSERT_EQUAL_UINT32(scan_window_us, m_scanner.config.scan_window_us);
    TEST_ASSERT_EQUAL_UINT32(scan_interval_us_double, m_scanner.timer_window_end.interval);
    TEST_ASSERT_EQUAL_UINT32(scan_interval_us_double, m_scanner.timer_window_start.interval);

    timer_now_ExpectAndReturn(TIME_NOW);
    timer_sch_abort_Expect(&m_scanner.timer_window_end);
    timer_sch_reschedule_Expect(&m_scanner.timer_window_start, TIME_NOW);
    scanner_config_scan_time_set(scan_interval_us, scan_window_us);

    /* Verify resulting state */
    TEST_ASSERT_EQUAL_UINT32(scan_interval_us, m_scanner.config.scan_interval_us);
    TEST_ASSERT_EQUAL_UINT32(scan_window_us, m_scanner.config.scan_window_us);
    TEST_ASSERT_EQUAL_UINT32(scan_interval_us, m_scanner.timer_window_end.interval);
    TEST_ASSERT_EQUAL_UINT32(scan_interval_us, m_scanner.timer_window_start.interval);

    /* Test invalid values */
    TEST_NRF_MESH_ASSERT_EXPECT(scanner_config_scan_time_set(scan_interval_us, scan_interval_us + 1));
    TEST_NRF_MESH_ASSERT_EXPECT(scanner_config_scan_time_set(MS_TO_US(BEARER_SCAN_INT_MAX_MS) + 1, scan_window_us));
    TEST_NRF_MESH_ASSERT_EXPECT(scanner_config_scan_time_set(scan_interval_us, MS_TO_US(BEARER_SCAN_WIN_MIN_MS) - 1));
}

void test_config_channels_set(void)
{
    uint8_t valid_channels[] = {37, 38, 39};
    uint8_t invalid_channels[] = {36, 38, 39};
    uint8_t too_many_channels[] = {37, 38, 39, 39};

    scanner_config_channels_set(valid_channels, sizeof(valid_channels) / sizeof(valid_channels[0]));

    /* Verify resulting state */
    TEST_ASSERT_EQUAL_UINT8_ARRAY(valid_channels,
                                  m_scanner.config.channels,
                                  sizeof(valid_channels) / sizeof(valid_channels[0]));
    TEST_ASSERT_EQUAL_UINT8(sizeof(valid_channels) / sizeof(valid_channels[0]), m_scanner.config.channel_count);
    TEST_ASSERT_EQUAL_UINT8(0, m_scanner.channel_index);

