NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_scanner.c
void test_radio_irq_handler_CTX_ENABLE_WINDOW_START(void)
{
    packet_buffer_packet_t * p_packet_buffer_packet =
        (packet_buffer_packet_t *)m_scanner.packet_buffer_data;

    scanner_init_helper();

    radio_config_reset_Expect();
    radio_config_config_Expect(&m_scanner.config.radio_config);
    radio_config_access_addr_set_Expect(BEARER_ACCESS_ADDR_DEFAULT, 0);
    scanner_radio_start();

    timer_now_ExpectAndReturn(TIME_NOW);
    timer_sch_abort_Expect(&m_scanner.timer_window_end);
    timer_sch_reschedule_Expect(&m_scanner.timer_window_start, TIME_NOW);
    scanner_enable();

    NVIC_SetPendingIRQ_Expect(RADIO_IRQn);
    m_scanner.timer_window_start.cb(TIME_NOW, NULL);

    /* Set up radio_setup_next_operation() */
    radio_config_channel_set_Expect(m_scanner.config.channels[1]);
    packet_buffer_reserve_ExpectAndReturn(&m_scanner.packet_buffer,
                                          &m_scanner.p_buffer_packet,
                                          sizeof(scanner_packet_t), NRF_SUCCESS);
    packet_buffer_reserve_ReturnThruPtr_pp_packet(&p_packet_buffer_packet);
    m_radio.PACKETPTR = 0;
    m_radio.TASKS_RXEN = 0;

    scanner_radio_irq_handler();

    /* Verify resulting state */
    TEST_ASSERT_NOT_NULL(m_scanner.p_buffer_packet);
    TEST_ASSERT_NOT_EQUAL(0, m_radio.PACKETPTR);
    TEST_ASSERT_EQUAL(1, m_radio.TASKS_RXEN);
}

void test_radio_irq_handler_WINDOW_START_DURING_RADIO_RX(void)
{
    packet_buffer_packet_t * p_packet_buffer_packet =
        (packet_buffer_packet_t *)m_scanner.packet_buffer_data;

    scanner_window_started_helper();

    /* Start new scan window (causing a channel change) */
    NVIC_SetPendingIRQ_Expect(RADIO_IRQn);
    m_scanner.timer_window_start.cb(TIME_NOW, NULL);
    TEST_ASSERT_EQUAL(2, m_scanner.channel_index);
    TEST_ASSERT_EQUAL(SCAN_WINDOW_STATE_NEXT_CHANNEL, m_scanner.window_state);

    /* Set up radio_handle_end_event() */
    packet_buffer_free_StubWithCallback(packet_buffer_free_callback_WINDOW_START_DURING_RADIO_RX);
    radio_config_channel_set_Expect(m_scanner.config.channels[2]);
    packet_buffer_reserve_ExpectAndReturn(&m_scanner.packet_buffer,
                                          &m_scanner.p_buffer_packet,
                                          sizeof(scanner_packet_t), NRF_SUCCESS);
    packet_buffer_reserve_ReturnThruPtr_pp_packet(&p_packet_buffer_packet);
    packet_buffer_free_callback_cnt = 0;
    m_radio.PACKETPTR = 0;
    m_radio.TASKS_RXEN = 0;

    scanner_radio_irq_handler();

    packet_buffer_free_StubWithCallback(NULL);

    /* Verify resulting state */
    TEST_ASSERT_EQUAL(1, packet_buffer_free_callback_cnt);
    TEST_ASSERT_EQUAL(1, m_radio.TASKS_DISABLE);
    TEST_ASSERT_EQUAL(SCAN_WINDOW_STATE_ON, m_scanner.window_state);
    TEST_ASSERT_NOT_NULL(m_scanner.p_buffer_packet);
    TEST_ASSERT_NOT_EQUAL(0, m_radio.PACKETPTR);
    TEST_ASSERT_EQUAL(1, m_radio.TASKS_RXEN);
}

void test_timer_scan_window_start_callback_NO_CHANNEL_INDEX_WRAP(void)
{
    scanner_start_helper();

    NVIC_SetPendingIRQ_Expect(RADIO_IRQn);

    m_scanner.timer_window_start.cb(TIME_NOW, NULL);

    /* Verify resulting state */
    TEST_ASSERT_EQUAL(1, m_scanner.channel_index);
    TEST_ASSERT_EQUAL(SCAN_WINDOW_STATE_NEXT_CHANNEL, m_scanner.window_state);
}

void test_timer_scan_window_start_callback_CHANNEL_INDEX_WRAP(void)
{
    scanner_start_helper();

    m_scanner.channel_index = m_scanner.config.channel_count - 1;
    NVIC_SetPendingIRQ_Expect(RADIO_IRQn);

    m_scanner.timer_window_start.cb(TIME_NOW, NULL);

    /* Verify resulting state */
    TEST_ASSERT_EQUAL(0, m_scanner.channel_index);
    TEST_ASSERT_EQUAL(SCAN_WINDOW_STATE_NEXT_CHANNEL, m_scanner.window_state);
}

void test_timer_scan_window_end_callback(void)
{
    scanner_window_started_helper();

    NVIC_SetPendingIRQ_Expect(RADIO_IRQn);

    m_scanner.timer_window_end.cb(TIME_NOW, NULL);

    /* Verify resulting state */
    TEST_ASSERT_EQUAL(1, m_scanner.channel_index);
    TEST_ASSERT_EQUAL(SCAN_WINDOW_STATE_OFF, m_scanner.window_state);
}
